#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
Warning: "bucket_policy_only": [DEPRECATED] Please use the uniform_bucket_level_access as this field has been renamed by Google.

  on main.tf line 30, in resource "google_storage_bucket" "policy_bucket":
  30: resource "google_storage_bucket" "policy_bucket" {


Success! The configuration is valid, but there were some validation warnings as shown above.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.pubsub_scheduled_example.module.main.null_resource.dependent_files: Refreshing state... [id=6366462742101406435]
module.pubsub_scheduled_example.module.main.data.null_data_source.wait_for_files: Refreshing state... [id=static]
random_id.random: Refreshing state... [id=Do8Uvg]
module.pubsub_scheduled_example.module.main.data.archive_file.main: Refreshing state... [id=b94d02127c9f1e7d6379b16491f27bda901132f8]
google_service_account.org_policy_compare_sa: Refreshing state... [id=projects/orgpolicy-notifier/serviceAccounts/org-policy-compare@orgpolicy-notifier.iam.gserviceaccount.com]
google_storage_bucket.policy_bucket: Refreshing state... [id=orgpolicy-notifier-policy-bucket-0e8f14be]
module.pubsub_scheduled_example.module.main.google_storage_bucket.main: Refreshing state... [id=orgpolicy-notifier-cfn-bucket-0e8f14be]
google_organization_iam_custom_role.org_policy_compare_custom_role: Refreshing state... [id=organizations/948721840059/roles/org_policy_compare_cfn]
module.pubsub_scheduled_example.module.pubsub_topic.google_pubsub_topic.topic[0]: Refreshing state... [id=projects/orgpolicy-notifier/topics/orgpolicy-notifier-topic]
module.pubsub_scheduled_example.module.main.google_storage_bucket_object.main: Refreshing state... [id=orgpolicy-notifier-cfn-bucket-0e8f14be-ab64fb6711e0c2aaa2b840f058f4dc6c-src.zip]
module.pubsub_scheduled_example.google_cloud_scheduler_job.job[0]: Refreshing state... [id=orgpolicy-notifier-job-0e8f14be]
google_organization_iam_member.org_policy_compare_member: Refreshing state... [id=948721840059/organizations/948721840059/roles/org_policy_compare_cfn/serviceaccount:org-policy-compare@orgpolicy-notifier.iam.gserviceaccount.com]
module.pubsub_scheduled_example.module.main.google_cloudfunctions_function.main: Refreshing state... [id=orgpolicy-notifier/us-central1/orgpolicy-notifier-0e8f14be]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.pubsub_scheduled_example.random_id.suffix will be created
  + resource "random_id" "suffix" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.pubsub_scheduled_example.module.main.google_cloudfunctions_function.main will be updated in-place
  ~ resource "google_cloudfunctions_function" "main" {
        available_memory_mb   = 2048
        description           = "Compares Org Policies and alerts users."
        entry_point           = "announce_kickoff"
      ~ environment_variables = {
          ~ "ACCESS_TOKEN_NAME"        = "twitter_access_token" -> "dev_twitter_access_token"
          ~ "ACCESS_TOKEN_SECRET_NAME" = "twitter_access_secret" -> "dev_twitter_access_secret"
          ~ "CONSUMER_KEY_NAME"        = "twitter_api_key" -> "dev_twitter_api_key"
          ~ "CONSUMER_KEY_SECRET_NAME" = "twitter_api_secret" -> "dev_twitter_api_secret"
            "FILE_LOCATION"            = "/tmp/policies.txt"
            "ORG_ID"                   = "948721840059"
            "POLICY_BUCKET"            = "orgpolicy-notifier-policy-bucket-0e8f14be"
            "POLICY_FILE"              = "policies.txt"
            "S_PROJECT"                = "orgpolicy-notifier"
          ~ "S_SLACK_NAME"             = "slack_webhook" -> "dev_slack_webhook"
          ~ "S_TOKEN_NAME"             = "github_token" -> "dev_github_token"
            "S_VERSION"                = "latest"
        }
        id                    = "orgpolicy-notifier/us-central1/orgpolicy-notifier-0e8f14be"
        ingress_settings      = "ALLOW_ALL"
        labels                = {}
        max_instances         = 0
        name                  = "orgpolicy-notifier-0e8f14be"
        project               = "orgpolicy-notifier"
        region                = "us-central1"
        runtime               = "python37"
        service_account_email = "org-policy-compare@orgpolicy-notifier.iam.gserviceaccount.com"
        source_archive_bucket = "orgpolicy-notifier-cfn-bucket-0e8f14be"
        source_archive_object = "ab64fb6711e0c2aaa2b840f058f4dc6c-src.zip"
        timeout               = 60

        event_trigger {
            event_type = "google.pubsub.topic.publish"
            resource   = "projects/orgpolicy-notifier/topics/orgpolicy-notifier-topic"

            failure_policy {
                retry = false
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "environment" but a value
was found in file "terraform.tfvars". To use this value, add a "variable"
block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


Warning: "bucket_policy_only": [DEPRECATED] Please use the uniform_bucket_level_access as this field has been renamed by Google.

  on main.tf line 30, in resource "google_storage_bucket" "policy_bucket":
  30: resource "google_storage_bucket" "policy_bucket" {



------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @scalesec-automation-bot, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform lint and apply`*